# Merging
- it is based on common key (or column) and simmilar to SQL joins.
- its used when we want to allign data from two differnet datasets based on shared values.(eg: ID,names)
# joiining
- a special case of merging that combines DFs based on their index or key column
- it is typically used when DFs share a common index
# concatenation
- Stacks DFs either vertically (adding rows) or horizontally(adding columns)
- It is used when combing datasets with similar structues without matching keys

# Merge Practical

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
tips = sns.load_dataset('tips')
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [9]:
tips['customer_id']=pd.Series(np.arange(1,245))
tips

     total_bill   tip     sex smoker   day    time  size  customer_id
0         16.99  1.01  Female     No   Sun  Dinner     2            1
1         10.34  1.66    Male     No   Sun  Dinner     3            2
2         21.01  3.50    Male     No   Sun  Dinner     3            3
3         23.68  3.31    Male     No   Sun  Dinner     2            4
4         24.59  3.61  Female     No   Sun  Dinner     4            5
..          ...   ...     ...    ...   ...     ...   ...          ...
239       29.03  5.92    Male     No   Sat  Dinner     3          240
240       27.18  2.00  Female    Yes   Sat  Dinner     2          241
241       22.67  2.00    Male    Yes   Sat  Dinner     2          242
242       17.82  1.75    Male     No   Sat  Dinner     2          243
243       18.78  3.00  Female     No  Thur  Dinner     2          244

[244 rows x 8 columns]

In [8]:
tips.head()

   total_bill   tip     sex smoker  day    time  size  customer_id
0       16.99  1.01  Female     No  Sun  Dinner     2            1
1       10.34  1.66    Male     No  Sun  Dinner     3            2
2       21.01  3.50    Male     No  Sun  Dinner     3            3
3       23.68  3.31    Male     No  Sun  Dinner     2            4
4       24.59  3.61  Female     No  Sun  Dinner     4            5

In [11]:
customer_data = pd.DataFrame({
    'customer_id':[1,2,3,4,5],
    'name':['Geeta','Ram','Hari','Shyam','Rupa']
})
customer_data

   customer_id   name
0            1  Geeta
1            2    Ram
2            3   Hari
3            4  Shyam
4            5   Rupa

In [12]:
tips.merge(customer_data,on='customer_id',how='inner')

   total_bill   tip     sex smoker  day    time  size  customer_id   name
0       16.99  1.01  Female     No  Sun  Dinner     2            1  Geeta
1       10.34  1.66    Male     No  Sun  Dinner     3            2    Ram
2       21.01  3.50    Male     No  Sun  Dinner     3            3   Hari
3       23.68  3.31    Male     No  Sun  Dinner     2            4  Shyam
4       24.59  3.61  Female     No  Sun  Dinner     4            5   Rupa

In [16]:
find_tips=pd.merge(tips,customer_data,on='customer_id',how='left')
find_tips

     total_bill   tip     sex smoker   day    time  size  customer_id   name
0         16.99  1.01  Female     No   Sun  Dinner     2            1  Geeta
1         10.34  1.66    Male     No   Sun  Dinner     3            2    Ram
2         21.01  3.50    Male     No   Sun  Dinner     3            3   Hari
3         23.68  3.31    Male     No   Sun  Dinner     2            4  Shyam
4         24.59  3.61  Female     No   Sun  Dinner     4            5   Rupa
..          ...   ...     ...    ...   ...     ...   ...          ...    ...
239       29.03  5.92    Male     No   Sat  Dinner     3          240    NaN
240       27.18  2.00  Female    Yes   Sat  Dinner     2          241    NaN
241       22.67  2.00    Male    Yes   Sat  Dinner     2          242    NaN
242       17.82  1.75    Male     No   Sat  Dinner     2          243    NaN
243       18.78  3.00  Female     No  Thur  Dinner     2          244    NaN

[244 rows x 9 columns]

In [17]:
customer_data_conflict=pd.DataFrame(
    {
    'customer_id':[1,2,3,4,5],
    'name':['Geeta','Ram','Hari','Shyam','Rupa'],
        'size':['small','medium','large','small','medium']
    }
)
customer_data_conflict

   customer_id   name    size
0            1  Geeta   small
1            2    Ram  medium
2            3   Hari   large
3            4  Shyam   small
4            5   Rupa  medium

In [19]:
tips.merge(customer_data_conflict,on='customer_id',how='inner',suffixes=['_tips','_customer'])

,total_bill,tip,sex,smoker,day,time,size_tips,customer_id,name,size_customer
0,16.99,1.01,Female,No,Sun,Dinner,2,1,Geeta,small
1,10.34,1.66,Male,No,Sun,Dinner,3,2,Ram,medium
2,21.01,3.50,Male,No,Sun,Dinner,3,3,Hari,large
3,23.68,3.31,Male,No,Sun,Dinner,2,4,Shyam,small
4,24.59,3.61,Female,No,Sun,Dinner,4,5,Rupa,medium

# merge from multiple columns

In [28]:
shift_data=pd.DataFrame({
    'day': ['Sun','Sun','Fri','Sat'],
    'time':['Dinner','Lunch','Dinner','Lunch'],
    'shift_manager':['Geeta','Ram','Hari','Shyam']
})
shift_data

   day    time shift_manager
0  Sun  Dinner         Geeta
1  Sun   Lunch           Ram
2  Fri  Dinner          Hari
3  Sat   Lunch         Shyam

In [30]:
tips.merge(shift_data,on=['day','time'],how='left')

,total_bill,tip,sex,smoker,day,time,size,customer_id,shift_manager
0,16.99,1.01,Female,No,Sun,Dinner,2,1,Geeta
1,10.34,1.66,Male,No,Sun,Dinner,3,2,Geeta
2,21.01,3.50,Male,No,Sun,Dinner,3,3,Geeta
3,23.68,3.31,Male,No,Sun,Dinner,2,4,Geeta
4,24.59,3.61,Female,No,Sun,Dinner,4,5,Geeta
...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,240,NaN
240,27.18,2.00,Female,Yes,Sat,Dinner,2,241,NaN
241,22.67,2.00,Male,Yes,Sat,Dinner,2,242,NaN
242,17.82,1.75,Male,No,Sat,Dinner,2,243,NaN
243,18.78,3.00,Female,No,Thur,Dinner,2,244,NaN

# Join

In [33]:
tips_subset=tips.set_index('customer_id')
customer_data_subset= customer_data.set_index('customer_id')

In [34]:
tips_subset.join(customer_data_subset,on='customer_id',how='inner')

             total_bill   tip     sex smoker  day    time  size   name
customer_id
1                 16.99  1.01  Female     No  Sun  Dinner     2  Geeta
2                 10.34  1.66    Male     No  Sun  Dinner     3    Ram
3                 21.01  3.50    Male     No  Sun  Dinner     3   Hari
4                 23.68  3.31    Male     No  Sun  Dinner     2  Shyam
5                 24.59  3.61  Female     No  Sun  Dinner     4   Rupa

In [35]:
customer_data_conflict_subset=customer_data_conflict.set_index('customer_id')

In [37]:
tips_subset.join(customer_data_conflict_subset,lsuffix='_tips',rsuffix='_customers')

,total_bill,tip,sex,smoker,day,time,size_tips,name,size_customers
customer_id,,,,,,,,,
1,16.99,1.01,Female,No,Sun,Dinner,2,Geeta,small
2,10.34,1.66,Male,No,Sun,Dinner,3,Ram,medium
3,21.01,3.50,Male,No,Sun,Dinner,3,Hari,large
4,23.68,3.31,Male,No,Sun,Dinner,2,Shyam,small
5,24.59,3.61,Female,No,Sun,Dinner,4,Rupa,medium
...,...,...,...,...,...,...,...,...,...
240,29.03,5.92,Male,No,Sat,Dinner,3,NaN,NaN
241,27.18,2.00,Female,Yes,Sat,Dinner,2,NaN,NaN
242,22.67,2.00,Male,Yes,Sat,Dinner,2,NaN,NaN
243,17.82,1.75,Male,No,Sat,Dinner,2,NaN,NaN
244,18.78,3.00,Female,No,Thur,Dinner,2,NaN,NaN

In [39]:
tips_subset.loc[[1,2,3,6,7]].join(customer_data_subset)

             total_bill   tip     sex smoker  day    time  size   name
customer_id
1                 16.99  1.01  Female     No  Sun  Dinner     2  Geeta
2                 10.34  1.66    Male     No  Sun  Dinner     3    Ram
3                 21.01  3.50    Male     No  Sun  Dinner     3   Hari
6                 25.29  4.71    Male     No  Sun  Dinner     4    NaN
7                  8.77  2.00    Male     No  Sun  Dinner     2    NaN

In [40]:
tips_subset.loc[[1,2,3,6,7]].join(customer_data_subset,how='outer')

             total_bill   tip     sex smoker  day    time  size   name
customer_id
1                 16.99  1.01  Female     No  Sun  Dinner   2.0  Geeta
2                 10.34  1.66    Male     No  Sun  Dinner   3.0    Ram
3                 21.01  3.50    Male     No  Sun  Dinner   3.0   Hari
4                   NaN   NaN     NaN    NaN  NaN     NaN   NaN  Shyam
5                   NaN   NaN     NaN    NaN  NaN     NaN   NaN   Rupa
6                 25.29  4.71    Male     No  Sun  Dinner   4.0    NaN
7                  8.77  2.00    Male     No  Sun  Dinner   2.0    NaN

In [41]:
tips_subset

             total_bill   tip     sex smoker   day    time  size
customer_id
1                 16.99  1.01  Female     No   Sun  Dinner     2
2                 10.34  1.66    Male     No   Sun  Dinner     3
3                 21.01  3.50    Male     No   Sun  Dinner     3
4                 23.68  3.31    Male     No   Sun  Dinner     2
5                 24.59  3.61  Female     No   Sun  Dinner     4
...                 ...   ...     ...    ...   ...     ...   ...
240               29.03  5.92    Male     No   Sat  Dinner     3
241               27.18  2.00  Female    Yes   Sat  Dinner     2
242               22.67  2.00    Male    Yes   Sat  Dinner     2
243               17.82  1.75    Male     No   Sat  Dinner     2
244               18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [43]:
customer_data

   customer_id   name
0            1  Geeta
1            2    Ram
2            3   Hari
3            4  Shyam
4            5   Rupa

In [46]:
# index amd column
tips_subset.merge(customer_data , right_on='customer_id',left_index=True)

   total_bill   tip     sex smoker  day    time  size  customer_id   name
0       16.99  1.01  Female     No  Sun  Dinner     2            1  Geeta
1       10.34  1.66    Male     No  Sun  Dinner     3            2    Ram
2       21.01  3.50    Male     No  Sun  Dinner     3            3   Hari
3       23.68  3.31    Male     No  Sun  Dinner     2            4  Shyam
4       24.59  3.61  Female     No  Sun  Dinner     4            5   Rupa

In [47]:
tips_subset.merge(customer_data_conflict, right_on='customer_id',left_index=True)

,total_bill,tip,sex,smoker,day,time,size_x,customer_id,name,size_y
0,16.99,1.01,Female,No,Sun,Dinner,2,1,Geeta,small
1,10.34,1.66,Male,No,Sun,Dinner,3,2,Ram,medium
2,21.01,3.50,Male,No,Sun,Dinner,3,3,Hari,large
3,23.68,3.31,Male,No,Sun,Dinner,2,4,Shyam,small
4,24.59,3.61,Female,No,Sun,Dinner,4,5,Rupa,medium

# Concatenation

In [3]:
tips=sns.load_dataset('tips')
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

# split tips into 3 parts

In [4]:
tips_1 = tips.iloc[:3]
tips_2 = tips.iloc[3:6]
tips_3 = tips.iloc[6:9]
tips_1

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

In [6]:
tips_2

   total_bill   tip     sex smoker  day    time  size
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4

In [11]:
# concatenate vertically with keys
vertical_concat=pd.concat([tips_1,tips_2,tips_3],axis=0,keys=['Part1','Part2','Part3'])
vertical_concat

         total_bill   tip     sex smoker  day    time  size
Part1 0       16.99  1.01  Female     No  Sun  Dinner     2
      1       10.34  1.66    Male     No  Sun  Dinner     3
      2       21.01  3.50    Male     No  Sun  Dinner     3
Part2 3       23.68  3.31    Male     No  Sun  Dinner     2
      4       24.59  3.61  Female     No  Sun  Dinner     4
      5       25.29  4.71    Male     No  Sun  Dinner     4
Part3 6        8.77  2.00    Male     No  Sun  Dinner     2
      7       26.88  3.12    Male     No  Sun  Dinner     4
      8       15.04  1.96    Male     No  Sun  Dinner     2

In [17]:
vertical_concat.index

MultiIndex([('Part1', 0),
            ('Part1', 1),
            ('Part1', 2),
            ('Part2', 3),
            ('Part2', 4),
            ('Part2', 5),
            ('Part3', 6),
            ('Part3', 7),
            ('Part3', 8)],
           )

In [18]:
vertical_concat.loc['Part1']

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

In [22]:
extra_data=pd.DataFrame({
    'customer_id':[1,2,3,4,5],
    'rating':[4,5,2,3,2]
}, index= tips.head().index)
extra_data

   customer_id  rating
0            1       4
1            2       5
2            3       2
3            4       3
4            5       2

In [25]:
pd.concat([tips.head(),extra_data],axis=1, join='outer')

   total_bill   tip     sex smoker  day    time  size  customer_id  rating
0       16.99  1.01  Female     No  Sun  Dinner     2            1       4
1       10.34  1.66    Male     No  Sun  Dinner     3            2       5
2       21.01  3.50    Male     No  Sun  Dinner     3            3       2
3       23.68  3.31    Male     No  Sun  Dinner     2            4       3
4       24.59  3.61  Female     No  Sun  Dinner     4            5       2

In [27]:
# Ignore index
pd.concat([tips_1,tips_2,tips_3],axis=0,ignore_index=True)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2